# ~/Brewfile
# homebrew formulas list
# Adrian Juszczak
# adrian@juszczak.io
# https://git.io/juszczak

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/services'
cask 'java'
cask 'xquartz'
brew 'ack'
brew 'android-sdk'
brew 'autoconf'
brew 'xz'
brew 'autoconf-archive'
brew 'automake'
brew 'awscli'
brew 'readline'
brew 'bash', args: ['devel']
brew 'bash-completion'
brew 'boot-clj'
brew 'brew-gem'
brew 'pkg-config'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'cairo'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'nspr'
brew 'spidermonkey'
brew 'icu4c'
brew 'libtool'
brew 'openssl'
brew 'jpeg'
brew 'libtiff'
brew 'wxmac'
brew 'erlang'
brew 'couchdb'
brew 'cscope'
brew 'ctags'
brew 'curl'
brew 'pcre'
brew 'git'
brew 'go'
brew 'doctl'
brew 'editorconfig'
brew 'elm'
brew 'flow'
brew 'fpp'
brew 'gd'
brew 'gdbm'
brew 'gist'
brew 'git-lfs'
brew 'gnupg'
brew 'lua'
brew 'pdflib-lite'
brew 'qt'
brew 'gnuplot', args: ['with-cairo', 'with-pdflib-lite', 'with-wxmac', 'with-x11', 'without-lua']
brew 'gobject-introspection'
brew 'graphicsmagick'
brew 'harfbuzz'
brew 'libyaml'
brew 'ruby'
brew 'heroku'
brew 'htop-osx'
brew 'hub'
brew 'pango'
brew 'imagemagick'
brew 'libevent'
brew 'libsass'
brew 'luajit'
brew 'sqlite'
brew 'python'
brew 'macvim', args: ['with-lua', 'with-luajit', 'with-override-system-vim']
brew 'markdown'
brew 'memcached'
brew 'tokyo-cabinet'
brew 's-lang'
brew 'mutt'
brew 'nginx'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'pwsafe'
brew 'pyenv'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 's3cmd'
brew 'sassc'
brew 'scons'
brew 'slurm'
brew 'spark'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'unixodbc'
brew 'unrar'
brew 'urlview'
brew 'vifm'
brew 'watchman'
brew 'wget'
brew 'zeromq'
cask '1password'
cask 'adobe-creative-cloud'
cask 'amethyst'
cask 'arduino'
cask 'atom'
cask 'caffeine'
cask 'codekit'
cask 'cyberduck'
cask 'dropbox'
cask 'epic'
cask 'firefox'
cask 'flashlight'
cask 'fritzing'
cask 'gitkraken'
cask 'google-chrome'
cask 'gpgtools'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'livechat'
cask 'mamp'
cask 'opera'
cask 'postman'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'seil'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity'
cask 'vlc'
cask 'webpquicklook'
